# -*- coding: utf-8 -*

class RuGraphAnalizer:
    def __init__(self, rugraph, videos):
        pass

    def show_node_specialisation_first_layer(self, node):
        # включаем видео за видео, и собираем пары вида
        # уровень активности нейрона : входная картика его рецептивного поля (сенсоры)
        # когда картинок набирается много, то
        # считаем взвешенную сумму каринок, а в качестве веса берем уровень кативности на картике

        #если получается равномерно серое нечто, то не специализирвался наш нейрон
        pass
